<a href="https://colab.research.google.com/github/ratfarts/datasharing/blob/master/Copy_of_webinar_content_students.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

<p align="center">
<img src="https://cdn.datacamp.com/main-app/assets/brand/datacamp-horizontal-rgb-b641f95b7bdd7560b554c761a0b4910f9619907dd823c0e41244ed72078723bf.svg" alt = "DataCamp icon" width="50%">
</p>
<br><br>

## **Python for Excel Users**


Welcome to this live, hands-on training where you will learn how to upgrade from being an Excel user to using Python. 

In most organizations across all industries, data fluency, technical skills and a data-driven mindset are becoming sought after skills that drive organizational success in the digital age. This shift has spurred on the adoption of tools that go beyond Excel, which allow for more robust data analysis, visualization and presentation. In this notebook, you will learn:

* How to import Excel files into `pandas`.
* Filter, add new columns, and explore DataFrames.
* Apply common Excel operations such as pivot tables and VLOOKUP in Python.
* Present data as visualizations using `matplotlib` and `seaborn`.

The dataset to be used in this webinar is an Excel file named `sales_data_dirty.xlsx` - it contains 4 sheets, each containing the following columns:

<br>



![alt](https://github.com/adelnehme/python-for-excel-users-webinar/blob/master/image.png?raw=true)

## **Getting started with the dataset**

Similar to how you can download software (excel, tableau etc..) on your computer that allows you perform specific functions (data analysis, visualization ...) - Python has packages or modules that we download and install that allows to perform a set of tasks. We can also set aliases for these packages to shorten their name and make calling them more convenient.

In [0]:
# Import relevant packages
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

/usr/local/lib/python3.6/dist-packages/statsmodels/tools/_testing.py:19: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing as tm

In [0]:
# Import the data
data = pd.ExcelFile('https://github.com/adelnehme/python-for-excel-users-webinar/blob/master/sales_data_dirty.xlsx?raw=true')

In [0]:
# Print the name of the sheets
data.sheet_names

['sales', 'customers', 'dates', 'employees']

In [0]:
# Parse sales data
sales = data.parse('sales')
# Print dimensions and glimpse
print(sales.shape)
sales.head(5)

(31465, 5)

   SalesOrderID    TotalDue  NumberofItems  OnlineOrderFlag  Status
0         43659  23153.2339             12                0       5
1         43660   1457.3288              2                0       5
2         43661  36865.8012             15                0       5
3         43662  32474.9324             22                0       5
4         43663    472.3108              1                0       5

In [0]:
# Parse customers data 
customers = data.parse('customers')
# Print dimensions and glimpse
print(customers.shape)
customers.head(5)

(31465, 6)

   SalesOrderID CustomerFirstName  ... EmployeeLastName ChannelType
0         43659               NaN  ...           Reiter         NaN
1         43660               NaN  ...           Reiter         NaN
2         43661               NaN  ...          Saraiva         NaN
3         43662               NaN  ...          Saraiva         NaN
4         43663               NaN  ...         Mitchell         NaN

[5 rows x 6 columns]

In [0]:
# Parse dates data
dates = data.parse('dates')
# Print dimensions and glimpse
print(dates.shape)
dates.head(5)

(31465, 3)

   SalesOrderID            OrderDate             ShipDate
0         43659  2011-05-31 00:00:00  2011-06-07 00:00:00
1         43660  2011-05-31 00:00:00  2011-06-07 00:00:00
2         43661  2011-05-31 00:00:00  2011-06-07 00:00:00
3         43662  2011-05-31 00:00:00  2011-06-07 00:00:00
4         43663  2011-05-31 00:00:00  2011-06-07 00:00:00

In [0]:
# Parse employees data
employees = data.parse('employees')
# Print dimensions and glimpse
print(employees.shape)
employees.head(5)

(17, 5)

  FirstName  LastName CountryCode      RegionName  CommissionPct
0       Amy   Alberts          GB  United Kingdom          0.000
1     David  Campbell          US       Northwest          0.012
2   Garrett    Vargas          CA          Canada          0.010
3       Jae       Pak          CA          Canada          0.020
4   Jillian    Carson          US       Southwest          0.015

## **Better understanding our data**

Some important and common methods needed to get a better understanding of DataFrames are the following: 

- `.info()` provides a bird's eye view of column data types and missing values
- `.describe()` returns a distribution of numeric columns in your DataFrame
- `.unique()` gives out the number of unique values in a column

In [0]:
# Understand missingness of sales data
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 31465 entries, 0 to 31464
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   SalesOrderID     31465 non-null  int64
 1   TotalDue         31465 non-null  float64
 2   NumberofItems    31465 non-null  int64
 3   OnlineOrderFlag  31465 non-null  int64
 4   Status           31465 non-null  int64
dtypes: float64(1), int64(4)
memory usage: 1.2 MB

In [0]:
# Understand distribution of sales data
sales.describe()

       SalesOrderID       TotalDue  NumberofItems  OnlineOrderFlag   Status
count  31465.000000   31465.000000   31465.000000     31465.000000  31465.0
mean   59391.000000    3915.995109       3.855617         0.879040      5.0
std     9083.307446   12515.462713       7.214877         0.326086      0.0
min    43659.000000       1.518300       1.000000         0.000000      5.0
25%    51525.000000      62.951900       1.000000         1.000000      5.0
50%    59391.000000     865.204000       2.000000         1.000000      5.0
75%    67257.000000    2615.490800       3.000000         1.000000      5.0
max    75123.000000  187487.825000      72.000000         1.000000      5.0

In [0]:
# Make sure Status column has no other unique values
print(sales['Status'].unique())
print(sales['OnlineOrderFlag'].unique())

[5]
[0 1]

In [0]:
# Understand column types of dates and missingness
customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 31465 entries, 0 to 31464
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   SalesOrderID       31465 non-null  int64
 1   CustomerFirstName  17463 non-null  object
 2   CustomerLastName   17463 non-null  object
 3   EmployeeFirstName  3806 non-null   object
 4   EmployeeLastName   3806 non-null   object
 5   ChannelType        17463 non-null  object
dtypes: int64(1), object(5)
memory usage: 1.4+ MB

In [0]:
# Let's understand the degree of missingness in customers dataset

In [0]:
# How to find missing values?
customers.isna().sum()

SalesOrderID             0
CustomerFirstName    14002
CustomerLastName     14002
EmployeeFirstName    27659
EmployeeLastName     27659
ChannelType          14002
dtype: int64

## **Making our data analysis ready**

In [0]:
# Drop status column from sales

sales.drop('Status', axis = 1, inplace = True)
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 31465 entries, 0 to 31464
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   SalesOrderID     31465 non-null  int64
 1   TotalDue         31465 non-null  float64
 2   NumberofItems    31465 non-null  int64
 3   OnlineOrderFlag  31465 non-null  int64
dtypes: float64(1), int64(3)
memory usage: 983.4 KB

***A note on dictionaries***

Dictionaries are useful data structures in Python with the following format `my_dictionary = {key: value}` where a key is mapped to a value and whose value can be returned with `my_dictionary[key]`.

In [0]:
# Example
names = {'first_name':'Adel',
         'last_name': 'Nehme'}

names['first_name']

'Adel'

In [0]:
# Replace OnlineOrderFlag to offline and online

sales['OnlineOrderFlag'] = sales['OnlineOrderFlag'].replace({0: 'offline', 1: 'online'})
# Make sure it is the case
sales['OnlineOrderFlag'].unique()

array(['offline', 'online'], dtype=object)

In [0]:
# Convert data columns to datetime while keeping only Y,m,d

dates['OrderDate'] = pd.to_datetime(dates['OrderDate'], format = "%Y-%m-%d")
dates['ShipDate'] = pd.to_datetime(dates['ShipDate'], format = "%Y-%m-%d")

In [0]:
# Make sure now into datetime
dates.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 31465 entries, 0 to 31464
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   SalesOrderID  31465 non-null  int64
 1   OrderDate     31465 non-null  datetime64[ns]
 2   ShipDate      31465 non-null  datetime64[ns]
dtypes: datetime64[ns](2), int64(1)
memory usage: 737.6 KB

In [0]:
# Impute missing values based on key business assumptions
customers.loc[customers['EmployeeFirstName'].isnull(), 'ChannelType'] = "B2C"
customers.loc[customers['EmployeeFirstName'].notnull(), 'ChannelType'] = "B2B"

In [0]:
# Make sure no more missing data in ChannelType
customers.isna().sum()

SalesOrderID             0
CustomerFirstName    14002
CustomerLastName     14002
EmployeeFirstName    27659
EmployeeLastName     27659
ChannelType              0
dtype: int64

In [0]:
# Combine first and last name in customers
customers['FullName'] = customers['EmployeeFirstName'] + " " + customers['EmployeeLastName']
customers.head()

   SalesOrderID CustomerFirstName  ... ChannelType        FullName
0         43659               NaN  ...         B2B     Tsvi Reiter
1         43660               NaN  ...         B2B     Tsvi Reiter
2         43661               NaN  ...         B2B    José Saraiva
3         43662               NaN  ...         B2B    José Saraiva
4         43663               NaN  ...         B2B  Linda Mitchell

[5 rows x 7 columns]

In [0]:
# Combine first and last name in employees
employees['FullName'] = employees['FirstName'] + " " + employees['LastName']
employees.head()

  FirstName  LastName  ... CommissionPct        FullName
0       Amy   Alberts  ...         0.000     Amy Alberts
1     David  Campbell  ...         0.012  David Campbell
2   Garrett    Vargas  ...         0.010  Garrett Vargas
3       Jae       Pak  ...         0.020         Jae Pak
4   Jillian    Carson  ...         0.015  Jillian Carson

[5 rows x 6 columns]

### Q&A time!

## **Case studies**

### _Q1: How did we do in revenue over the years?_

Since we have revenue data for each `SalesOrderID` in the `sales` sheet - and the order date and ship date for each `SalesOrderID` in hte `dates` sheet - we want to combine both DataFrames similar to how a VLOOKUP would work. 

<br>

<p align="center">
<img src="https://github.com/adelnehme/python-for-excel-users-webinar/blob/master/pivots.png?raw=True" alt = "pivot" width="70%">
</p>

<br><br>

In more technical terms, we want to perform of left join of both DataFrames where `SalesOrderId` is a common column between them.


<p align="center">
<img src="https://github.com/adelnehme/python-for-excel-users-webinar/blob/master/left_join.png?raw=True" alt = "DataCamp icon" width="50%">
</p>





An example of how to merge a DataFrame in pandas is included below with the `.merge()` method, where we are merging `df_2` into `df_1` on a common column between them called `common_column`. The `how` argument determines which DataFrame to preserve - in this case it's `df_1` since it's on the **left**. This has the same logic as SQL joins as well.

`df_1.merge(df_2, on = 'common_column', how = 'left')`

In [0]:
# Merge data - the VLOOKUP of Excel

In [0]:
# Create column for year and month

To calculate the total revenue per year, we need to perform something like a PIVOT TABLE in Excel. In pandas, there's a variety of ways to acheive this - there is even a `.pivot_table()` method. However we will be using instead the `.groupby()` method which takes in as argument the column name being grouped by, and can be chained with other methods to compute interesting statistics. Here's an example of grouping by the column `col_A` of the example DataFrame `df_1` and computing the sum of the remaining columns:

`df_1.groupby('col_A').sum()`

In [0]:
# Extract revenue by year

There are many ways to perform visualizations in Python - the two most widely used visualization packages are `seaborn` (which is usually imported as `sns`) and `matplotlib.pyplot` (which is usually imported as `plt`). 

Without going into the details, we will be creating and customizing two types of visualizations in this notebook by using these functions:

- Barplots using `sns.barplot(x=,y=,data=)`
  - `x`: The column name to be used on the x-axis.
  - `y`: The column name to be used on the y-axis.
  - `data`: The data used to visualize
- Lineplots using `sns.lineplot(x=,y=,data=)`
  - `x`: The column name to be used on the x-axis.
  - `y`: The column name to be used on the y-axis.
  - `data`: The data used to visualize
- Setting figure labels by:
  - `plt.xlabel()` to set the x-axis label.
  - `plt.ylabel()` to set the y-axis label.
  - `plt.title()` to set the x-axis label.
  - `plt.xticks(rotation=)` to set the x-axis ticks with proper rotation
- Showing the plot with `plt.show()`

In [0]:
# Visualize it

In [0]:
# Is there seasonality?

In [0]:
# Visualize it

### _Q2: How is revenue divided by channel type overall and over time?_

Similar to how we merged the `sales` sheet with the `dates` sheet when answering Q1, we will be merging the `sales` sheet with the `customers` sheet to get the channel type, employee and customer names for each `SalesOrderID`.

<br>

<p align="center">
<img src="https://github.com/adelnehme/python-for-excel-users-webinar/blob/master/pivots2.png?raw=True" alt = "pivot" width="70%">
</p>

<br>

In [0]:
# Merge sales and customer data

In [0]:
# Identify revenue and amount sold by channel

In [0]:
# Visualize

In [0]:
# Merge sales, dates and customers data

In [0]:
# Group by year by channel type

In [0]:
# Visualize

### _Q3: Who are the employees responsible for the most B2B sales overall and in 2013?_

The `sales_customers_date` has already been created when we merged `sales` with `customers` and `dates` in Q1 and Q2

```py
# From Q1
sales_date = sales.merge(dates, on="SalesOrderID", how = "left")
# From Q2
sales_customers_date = sales_date.merge(customers, on = "SalesOrderID", how = "left")
```

In [0]:
# Group by employee performance

To be able to truly see the highest earning employees - we can use the `.sort_values()` method of a DataFrame. For example, we can sort `col_A` of the example DataFrame `df_1` as such:

`df_1.sort_values(by=,ascending=,inplace=)`

* `by` takes in the column name being sorted by
* `ascending` takes in `True` or `False` depending on whether we want to sort it by ascending order
* `inplace` takes in `True` or `False` depending on whether we want to save our changes in the same DataFrame being sorted.

In [0]:
# Sort it so we visualize it correctly

In [0]:
# Visualize

In [0]:
# Group by employee performance and year

In [0]:
# Sort to make it easier to visualize

In [0]:
# Who was the best last year?

In [0]:
# Visualize

### Q&A time!

### _Take-home question: Who were the highest earning (in compensation) employees in 2012?_

**Clues:**
- Compensation = Sales generated * Commission
- You need to use the all four sheets
- Sort your results by the amount of commission earned 

**Bonus points if:**
- You make your chart extra pretty
- Use syntax not covered in this session

**Submission details:**
- Share with us a code snippet with your output on LinkedIn, Twitter or Facebook
- Tag us on `@DataCamp` with the hashtag `#datacamplive`